<?php
/****************************************************************/
/*  BIBLIOTECAS                                                 */
/****************************************************************/
require_once '../include/db.php';
require_once '../include/phpLib_cadastro_aluno.php';



/****************************************************************/
/*  PARAMETROS DE ENTRADA                                       */
/****************************************************************/
$id                        = $_GET['idAluno'];

//echo '<pre>'; print_r($id); exit;
/****************************************************************/
/*  CONFIGURAÇÕES                                               */
/****************************************************************/
$retorno_sucesso        = '../pesq_alunos.php?msg=sucessagem';
$retorno_falha1         = '../pesq_alunos.php?msg=Errooooou';



/****************************************************************/
/*  SCRIPT                                                      */
/****************************************************************/
$idAluno = phpLib_update_desabilita_aluno($id);
if(!$idAluno) {
    header('Location: '.$retorno_falha1);
    exit;
}




/****************************************************************/
/*  FINALIZAR                                                   */
/****************************************************************/
header('Location: '.$retorno_sucesso);
exit;
